
===========================================================================
report_tns
============================================================================
tns -1977.12

===========================================================================
report_wns
============================================================================
wns -5.55

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.55

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.09
