
===========================================================================
report_tns
============================================================================
tns -2111.39

===========================================================================
report_wns
============================================================================
wns -6.01

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.01

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.10
